betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_gpio.h
/**
  *
  * @file    apm32f4xx_ddl_gpio.h
  * @brief   Header file of GPIO DDL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DDL_GPIO_H
#define APM32F4xx_DDL_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx.h"

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined (GPIOA) || defined (GPIOB) || defined (GPIOC) || defined (GPIOD) || defined (GPIOE) || defined (GPIOF) || defined (GPIOG) || defined (GPIOH) || defined (GPIOI) || defined (GPIOJ) || defined (GPIOK)

/** @defgroup GPIO_DDL GPIO
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup GPIO_DDL_Private_Macros GPIO Private Macros
  * @{
  */

/**
  * @}
  */
#endif /*USE_FULL_DDL_DRIVER*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup GPIO_DDL_ES_INIT GPIO Exported Init structures
  * @{
  */

/**
  * @brief LL GPIO Init Structure definition
  */
typedef struct
{
  uint32_t Pin;          /*!< Specifies the GPIO pins to be configured.
                              This parameter can be any value of @ref GPIO_DDL_EC_PIN */

  uint32_t Mode;         /*!< Specifies the operating mode for the selected pins.
                              This parameter can be a value of @ref GPIO_DDL_EC_MODE.

                              GPIO HW configuration can be modified afterwards using unitary function @ref DDL_GPIO_SetPinMode().*/

  uint32_t Speed;        /*!< Specifies the speed for the selected pins.
                              This parameter can be a value of @ref GPIO_DDL_EC_SPEED.

                              GPIO HW configuration can be modified afterwards using unitary function @ref DDL_GPIO_SetPinSpeed().*/

  uint32_t OutputType;   /*!< Specifies the operating output type for the selected pins.
                              This parameter can be a value of @ref GPIO_DDL_EC_OUTPUT.

                              GPIO HW configuration can be modified afterwards using unitary function @ref DDL_GPIO_SetPinOutputType().*/

  uint32_t Pull;         /*!< Specifies the operating Pull-up/Pull down for the selected pins.
                              This parameter can be a value of @ref GPIO_DDL_EC_PULL.

                              GPIO HW configuration can be modified afterwards using unitary function @ref DDL_GPIO_SetPinPull().*/

#if defined (GPIO_ALFL_ALFSEL0)
  uint32_t Alternate;    /*!< Specifies the Peripheral to be connected to the selected pins.
                              This parameter can be a value of @ref GPIO_DDL_EC_AF.

                              GPIO HW configuration can be modified afterwards using unitary function @ref DDL_GPIO_SetAFPin_0_7() and DDL_GPIO_SetAFPin_8_15().*/
#endif /* GPIO_ALFL_ALFSEL0 */
} DDL_GPIO_InitTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup GPIO_DDL_Exported_Constants GPIO Exported Constants
  * @{
  */

/** @defgroup GPIO_DDL_EC_PIN PIN
  * @{
  */
#if defined (GPIO_PIN_MASK_POS)
#define DDL_GPIO_PIN_0                    ((GPIO_BSC_BS0  << GPIO_PIN_MASK_POS) | 0x00000001U)  /*!< Select pin 0  */
#define DDL_GPIO_PIN_1                    ((GPIO_BSC_BS1  << GPIO_PIN_MASK_POS) | 0x00000002U)  /*!< Select pin 1  */
#define DDL_GPIO_PIN_2                    ((GPIO_BSC_BS2  << GPIO_PIN_MASK_POS) | 0x00000004U)  /*!< Select pin 2  */
#define DDL_GPIO_PIN_3                    ((GPIO_BSC_BS3  << GPIO_PIN_MASK_POS) | 0x00000008U)  /*!< Select pin 3  */
#define DDL_GPIO_PIN_4                    ((GPIO_BSC_BS4  << GPIO_PIN_MASK_POS) | 0x00000010U)  /*!< Select pin 4  */
#define DDL_GPIO_PIN_5                    ((GPIO_BSC_BS5  << GPIO_PIN_MASK_POS) | 0x00000020U)  /*!< Select pin 5  */
#define DDL_GPIO_PIN_6                    ((GPIO_BSC_BS6  << GPIO_PIN_MASK_POS) | 0x00000040U)  /*!< Select pin 6  */
#define DDL_GPIO_PIN_7                    ((GPIO_BSC_BS7  << GPIO_PIN_MASK_POS) | 0x00000080U)  /*!< Select pin 7  */
#define DDL_GPIO_PIN_8                    ((GPIO_BSC_BS8  << GPIO_PIN_MASK_POS) | 0x04000001U)  /*!< Select pin 8  */
#define DDL_GPIO_PIN_9                    ((GPIO_BSC_BS9  << GPIO_PIN_MASK_POS) | 0x04000002U)  /*!< Select pin 9  */
#define DDL_GPIO_PIN_10                   ((GPIO_BSC_BS10 << GPIO_PIN_MASK_POS) | 0x04000004U)  /*!< Select pin 10 */
#define DDL_GPIO_PIN_11                   ((GPIO_BSC_BS11 << GPIO_PIN_MASK_POS) | 0x04000008U)  /*!< Select pin 11 */
#define DDL_GPIO_PIN_12                   ((GPIO_BSC_BS12 << GPIO_PIN_MASK_POS) | 0x04000010U)  /*!< Select pin 12 */
#define DDL_GPIO_PIN_13                   ((GPIO_BSC_BS13 << GPIO_PIN_MASK_POS) | 0x04000020U)  /*!< Select pin 13 */
#define DDL_GPIO_PIN_14                   ((GPIO_BSC_BS14 << GPIO_PIN_MASK_POS) | 0x04000040U)  /*!< Select pin 14 */
#define DDL_GPIO_PIN_15                   ((GPIO_BSC_BS15 << GPIO_PIN_MASK_POS) | 0x04000080U)  /*!< Select pin 15 */
#define DDL_GPIO_PIN_ALL                  (DDL_GPIO_PIN_0  | DDL_GPIO_PIN_1  | DDL_GPIO_PIN_2  | \
                                           DDL_GPIO_PIN_3  | DDL_GPIO_PIN_4  | DDL_GPIO_PIN_5  | \
                                           DDL_GPIO_PIN_6  | DDL_GPIO_PIN_7  | DDL_GPIO_PIN_8  | \
                                           DDL_GPIO_PIN_9  | DDL_GPIO_PIN_10 | DDL_GPIO_PIN_11 | \
                                           DDL_GPIO_PIN_12 | DDL_GPIO_PIN_13 | DDL_GPIO_PIN_14 | \
                                           DDL_GPIO_PIN_15)   /*!< Select all pins */
#else
#define DDL_GPIO_PIN_0                      GPIO_BSC_BS_0 /*!< Select pin 0 */
#define DDL_GPIO_PIN_1                      GPIO_BSC_BS_1 /*!< Select pin 1 */
#define DDL_GPIO_PIN_2                      GPIO_BSC_BS_2 /*!< Select pin 2 */
#define DDL_GPIO_PIN_3                      GPIO_BSC_BS_3 /*!< Select pin 3 */
#define DDL_GPIO_PIN_4                      GPIO_BSC_BS_4 /*!< Select pin 4 */
#define DDL_GPIO_PIN_5                      GPIO_BSC_BS_5 /*!< Select pin 5 */
#define DDL_GPIO_PIN_6                      GPIO_BSC_BS_6 /*!< Select pin 6 */
#define DDL_GPIO_PIN_7                      GPIO_BSC_BS_7 /*!< Select pin 7 */
#define DDL_GPIO_PIN_8                      GPIO_BSC_BS_8 /*!< Select pin 8 */
#define DDL_GPIO_PIN_9                      GPIO_BSC_BS_9 /*!< Select pin 9 */
#define DDL_GPIO_PIN_10                     GPIO_BSC_BS_10 /*!< Select pin 10 */
#define DDL_GPIO_PIN_11                     GPIO_BSC_BS_11 /*!< Select pin 11 */
#define DDL_GPIO_PIN_12                     GPIO_BSC_BS_12 /*!< Select pin 12 */
#define DDL_GPIO_PIN_13                     GPIO_BSC_BS_13 /*!< Select pin 13 */
#define DDL_GPIO_PIN_14                     GPIO_BSC_BS_14 /*!< Select pin 14 */
#define DDL_GPIO_PIN_15                     GPIO_BSC_BS_15 /*!< Select pin 15 */
#define DDL_GPIO_PIN_ALL                    (GPIO_BSC_BS_0 | GPIO_BSC_BS_1  | GPIO_BSC_BS_2  | \
                                           GPIO_BSC_BS_3  | GPIO_BSC_BS_4  | GPIO_BSC_BS_5  | \
                                           GPIO_BSC_BS_6  | GPIO_BSC_BS_7  | GPIO_BSC_BS_8  | \
                                           GPIO_BSC_BS_9  | GPIO_BSC_BS_10 | GPIO_BSC_BS_11 | \
                                           GPIO_BSC_BS_12 | GPIO_BSC_BS_13 | GPIO_BSC_BS_14 | \
                                           GPIO_BSC_BS_15) /*!< Select all pins */
#endif /* GPIO_PIN_MASK_POS */
/**
  * @}
  */

/** @defgroup GPIO_DDL_EC_MODE Mode
  * @{
  */
#if defined (GPIO_CFGLOW_MODE) && defined (GPIO_CFGHIG_MODE)
#define DDL_GPIO_MODE_ANALOG                0x00000000U          /*!< Select analog mode */
#define DDL_GPIO_MODE_FLOATING              GPIO_CFGLOW_CFG0_0   /*!< Select floating mode */
#define DDL_GPIO_MODE_INPUT                 GPIO_CFGLOW_CFG0_1   /*!< Select input mode */
#define DDL_GPIO_MODE_OUTPUT                GPIO_CFGLOW_MODE0_0  /*!< Select general purpose output mode */
#define DDL_GPIO_MODE_ALTERNATE             (GPIO_CFGLOW_CFG0_1 | GPIO_CFGLOW_MODE0_0) /*!< Select alternate function mode */
#else
#define DDL_GPIO_MODE_INPUT                 (0x00000000U)      /*!< Select input mode */
#define DDL_GPIO_MODE_OUTPUT                GPIO_MODE_MODE0_0  /*!< Select output mode */
#define DDL_GPIO_MODE_ALTERNATE             GPIO_MODE_MODE0_1  /*!< Select alternate function mode */
#define DDL_GPIO_MODE_ANALOG                GPIO_MODE_MODE0    /*!< Select analog mode */
#endif
/**
  * @}
  */

/** @defgroup GPIO_DDL_EC_OUTPUT Output Type
  * @{
  */
#define DDL_GPIO_OUTPUT_PUSHPULL            (0x00000000U)      /*!< Select push-pull as output type */
#if defined (GPIO_OMODE_OMODE0)
#define DDL_GPIO_OUTPUT_OPENDRAIN           GPIO_OMODE_OT_0    /*!< Select open-drain as output type */
#elif defined (GPIO_CFGLOW_MODE)
#define DDL_GPIO_OUTPUT_OPENDRAIN           GPIO_CFGLOW_CFG0_0 /*!< Select open-drain as output type */
#endif /* GPIO_OMODE_OMODE0 */
/**
  * @}
  */

