betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_gpio.h
/** @defgroup GPIO_DDL_EC_SPEED Output Speed
  * @{
  */
#if defined (GPIO_OSSEL_OSSEL0)
#define DDL_GPIO_SPEED_FREQ_LOW             (0x00000000U)            /*!< Select I/O low output speed    */
#define DDL_GPIO_SPEED_FREQ_MEDIUM          GPIO_OSPEEDER_OSPEEDR0_0 /*!< Select I/O medium output speed */
#define DDL_GPIO_SPEED_FREQ_HIGH            GPIO_OSPEEDER_OSPEEDR0_1 /*!< Select I/O fast output speed   */
#define DDL_GPIO_SPEED_FREQ_VERY_HIGH       GPIO_OSPEEDER_OSPEEDR0   /*!< Select I/O high output speed   */
#else
#define DDL_GPIO_MODE_OUTPUT_10MHz          GPIO_CFGLOW_MODE0_0      /*!< Select Output mode, max speed 10 MHz */
#define DDL_GPIO_MODE_OUTPUT_2MHz           GPIO_CFGLOW_MODE0_1      /*!< Select Output mode, max speed 20 MHz */
#define DDL_GPIO_MODE_OUTPUT_50MHz          GPIO_CFGLOW_MODE0        /*!< Select Output mode, max speed 50 MHz */

#define DDL_GPIO_SPEED_FREQ_LOW             DDL_GPIO_MODE_OUTPUT_2MHz    /*!< Select I/O low output speed    */
#define DDL_GPIO_SPEED_FREQ_MEDIUM          DDL_GPIO_MODE_OUTPUT_10MHz   /*!< Select I/O medium output speed */
#define DDL_GPIO_SPEED_FREQ_HIGH            DDL_GPIO_MODE_OUTPUT_50MHz   /*!< Select I/O high output speed   */
#endif /* GPIO_OSSEL_OSSEL0 */
/**
  * @}
  */

/** @defgroup GPIO_DDL_EC_PULL Pull Up Pull Down
  * @{
  */
#if defined (GPIO_PUPD_PUPD0)
#define DDL_GPIO_PULL_NO                    (0x00000000U)      /*!< Select I/O no pull */
#define DDL_GPIO_PULL_UP                    GPIO_PUPD_PUPDR0_0 /*!< Select I/O pull up */
#define DDL_GPIO_PULL_DOWN                  GPIO_PUPD_PUPDR0_1 /*!< Select I/O pull down */
#else
#define DDL_GPIO_PULL_DOWN                  0x00000000U          /*!< Select I/O pull down */
#define DDL_GPIO_PULL_UP                    GPIO_ODATA_ODATA0    /*!< Select I/O pull up */
#endif
/**
  * @}
  */

#if defined (GPIO_ALFL_ALFSEL0)
/** @defgroup GPIO_DDL_EC_AF Alternate Function
  * @{
  */
#define DDL_GPIO_AF_0                       (0x0000000U) /*!< Select alternate function 0 */
#define DDL_GPIO_AF_1                       (0x0000001U) /*!< Select alternate function 1 */
#define DDL_GPIO_AF_2                       (0x0000002U) /*!< Select alternate function 2 */
#define DDL_GPIO_AF_3                       (0x0000003U) /*!< Select alternate function 3 */
#define DDL_GPIO_AF_4                       (0x0000004U) /*!< Select alternate function 4 */
#define DDL_GPIO_AF_5                       (0x0000005U) /*!< Select alternate function 5 */
#define DDL_GPIO_AF_6                       (0x0000006U) /*!< Select alternate function 6 */
#define DDL_GPIO_AF_7                       (0x0000007U) /*!< Select alternate function 7 */
#define DDL_GPIO_AF_8                       (0x0000008U) /*!< Select alternate function 8 */
#define DDL_GPIO_AF_9                       (0x0000009U) /*!< Select alternate function 9 */
#define DDL_GPIO_AF_10                      (0x000000AU) /*!< Select alternate function 10 */
#define DDL_GPIO_AF_11                      (0x000000BU) /*!< Select alternate function 11 */
#define DDL_GPIO_AF_12                      (0x000000CU) /*!< Select alternate function 12 */
#define DDL_GPIO_AF_13                      (0x000000DU) /*!< Select alternate function 13 */
#define DDL_GPIO_AF_14                      (0x000000EU) /*!< Select alternate function 14 */
#define DDL_GPIO_AF_15                      (0x000000FU) /*!< Select alternate function 15 */
/**
  * @}
  */
#endif /* GPIO_ALFL_ALFSEL0 */

#if defined (AFIO)
/** @defgroup GPIO_LL_EVENTOUT_PIN EVENTOUT Pin
  * @{
  */

#define DDL_GPIO_AF_EVENTOUT_PIN_0        AFIO_EVCTRL_PINSEL_PX0   /*!< EVENTOUT on pin 0 */
#define DDL_GPIO_AF_EVENTOUT_PIN_1        AFIO_EVCTRL_PINSEL_PX1   /*!< EVENTOUT on pin 1 */
#define DDL_GPIO_AF_EVENTOUT_PIN_2        AFIO_EVCTRL_PINSEL_PX2   /*!< EVENTOUT on pin 2 */
#define DDL_GPIO_AF_EVENTOUT_PIN_3        AFIO_EVCTRL_PINSEL_PX3   /*!< EVENTOUT on pin 3 */
#define DDL_GPIO_AF_EVENTOUT_PIN_4        AFIO_EVCTRL_PINSEL_PX4   /*!< EVENTOUT on pin 4 */
#define DDL_GPIO_AF_EVENTOUT_PIN_5        AFIO_EVCTRL_PINSEL_PX5   /*!< EVENTOUT on pin 5 */
#define DDL_GPIO_AF_EVENTOUT_PIN_6        AFIO_EVCTRL_PINSEL_PX6   /*!< EVENTOUT on pin 6 */
#define DDL_GPIO_AF_EVENTOUT_PIN_7        AFIO_EVCTRL_PINSEL_PX7   /*!< EVENTOUT on pin 7 */
#define DDL_GPIO_AF_EVENTOUT_PIN_8        AFIO_EVCTRL_PINSEL_PX8   /*!< EVENTOUT on pin 8 */
#define DDL_GPIO_AF_EVENTOUT_PIN_9        AFIO_EVCTRL_PINSEL_PX9   /*!< EVENTOUT on pin 9 */
#define DDL_GPIO_AF_EVENTOUT_PIN_10       AFIO_EVCTRL_PINSEL_PX10  /*!< EVENTOUT on pin 10 */
#define DDL_GPIO_AF_EVENTOUT_PIN_11       AFIO_EVCTRL_PINSEL_PX11  /*!< EVENTOUT on pin 11 */
#define DDL_GPIO_AF_EVENTOUT_PIN_12       AFIO_EVCTRL_PINSEL_PX12  /*!< EVENTOUT on pin 12 */
#define DDL_GPIO_AF_EVENTOUT_PIN_13       AFIO_EVCTRL_PINSEL_PX13  /*!< EVENTOUT on pin 13 */
#define DDL_GPIO_AF_EVENTOUT_PIN_14       AFIO_EVCTRL_PINSEL_PX14  /*!< EVENTOUT on pin 14 */
#define DDL_GPIO_AF_EVENTOUT_PIN_15       AFIO_EVCTRL_PINSEL_PX15  /*!< EVENTOUT on pin 15 */

/**
  * @}
  */

/** @defgroup GPIO_DDL_EVENTOUT_PORT EVENTOUT Port
  * @{
  */

#define DDL_GPIO_AF_EVENTOUT_PORT_A       AFIO_EVCTRL_PORTSEL_PA  /*!< EVENTOUT on port A */
#define DDL_GPIO_AF_EVENTOUT_PORT_B       AFIO_EVCTRL_PORTSEL_PB  /*!< EVENTOUT on port B */
#define DDL_GPIO_AF_EVENTOUT_PORT_C       AFIO_EVCTRL_PORTSEL_PC  /*!< EVENTOUT on port C */
#define DDL_GPIO_AF_EVENTOUT_PORT_D       AFIO_EVCTRL_PORTSEL_PD  /*!< EVENTOUT on port D */

/**
  * @}
  */

/** @defgroup GPIO_DDL_EC_EINT_PORT GPIO EINT PORT
  * @{
  */
#define DDL_GPIO_AF_EINT_PORTA            0U   /*!< EINT PORT A */
#define DDL_GPIO_AF_EINT_PORTB            1U   /*!< EINT PORT B */
#define DDL_GPIO_AF_EINT_PORTC            2U   /*!< EINT PORT C */
#define DDL_GPIO_AF_EINT_PORTD            3U   /*!< EINT PORT D */
/**
  * @}
  */

/** @defgroup GPIO_DDL_EC_EINT_LINE GPIO EINT LINE
  * @{
  */
#define DDL_GPIO_AF_EINT_LINE0            (0x000FU << 16U | 0U)  /*!< AFIO_EINTSEL1  | EINT[0] */
#define DDL_GPIO_AF_EINT_LINE1            (0x00F0U << 16U | 0U)  /*!< AFIO_EINTSEL2  | EINT[0] */
#define DDL_GPIO_AF_EINT_LINE2            (0x0F00U << 16U | 0U)  /*!< AFIO_EINTSEL3  | EINT[0] */
#define DDL_GPIO_AF_EINT_LINE3            (0xF000U << 16U | 0U)  /*!< AFIO_EINTSEL4  | EINT[0] */
#define DDL_GPIO_AF_EINT_LINE4            (0x000FU << 16U | 1U)  /*!< AFIO_EINTSEL1  | EINT[1] */
#define DDL_GPIO_AF_EINT_LINE5            (0x00F0U << 16U | 1U)  /*!< AFIO_EINTSEL2  | EINT[1] */
#define DDL_GPIO_AF_EINT_LINE6            (0x0F00U << 16U | 1U)  /*!< AFIO_EINTSEL3  | EINT[1] */
#define DDL_GPIO_AF_EINT_LINE7            (0xF000U << 16U | 1U)  /*!< AFIO_EINTSEL4  | EINT[1] */
#define DDL_GPIO_AF_EINT_LINE8            (0x000FU << 16U | 2U)  /*!< AFIO_EINTSEL1  | EINT[2] */
#define DDL_GPIO_AF_EINT_LINE9            (0x00F0U << 16U | 2U)  /*!< AFIO_EINTSEL2  | EINT[2] */
#define DDL_GPIO_AF_EINT_LINE10           (0x0F00U << 16U | 2U)  /*!< AFIO_EINTSEL3  | EINT[2] */
#define DDL_GPIO_AF_EINT_LINE11           (0xF000U << 16U | 2U)  /*!< AFIO_EINTSEL4  | EINT[2] */
#define DDL_GPIO_AF_EINT_LINE12           (0x000FU << 16U | 3U)  /*!< AFIO_EINTSEL1  | EINT[3] */
#define DDL_GPIO_AF_EINT_LINE13           (0x00F0U << 16U | 3U)  /*!< AFIO_EINTSEL2  | EINT[3] */
#define DDL_GPIO_AF_EINT_LINE14           (0x0F00U << 16U | 3U)  /*!< AFIO_EINTSEL3  | EINT[3] */
#define DDL_GPIO_AF_EINT_LINE15           (0xF000U << 16U | 3U)  /*!< AFIO_EINTSEL4  | EINT[3] */
/**
  * @}
  */
#endif /* AFIO */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup GPIO_DDL_Exported_Macros GPIO Exported Macros
  * @{
  */

/** @defgroup GPIO_DDL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in GPIO register
  * @param  __INSTANCE__ GPIO Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define DDL_GPIO_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in GPIO register
  * @param  __INSTANCE__ GPIO Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define DDL_GPIO_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup GPIO_DDL_Exported_Functions GPIO Exported Functions
  * @{
  */

/** @defgroup GPIO_DDL_EF_Port_Configuration Port Configuration
  * @{
  */

/**
  * @brief  Configure gpio mode for a dedicated pin on dedicated port.
  * @note   I/O mode can be Input mode, General purpose output, Alternate function mode or Analog.
  * @note   Warning: only one pin can be passed as parameter.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_MODE_INPUT
  *         @arg @ref DDL_GPIO_MODE_OUTPUT
  *         @arg @ref DDL_GPIO_MODE_ALTERNATE
  *         @arg @ref DDL_GPIO_MODE_ANALOG
  *         @arg @ref DDL_GPIO_MODE_FLOATING (1)
  *
  *         (1) This parameter is only for APM32F402/403xx device.\n
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_SetPinMode(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t Mode)
{
#if defined (GPIO_MODE_MODE0)
  MODIFY_REG(GPIOx->MODE, (GPIO_MODE_MODE0 << (POSITION_VAL(Pin) * 2U)), (Mode << (POSITION_VAL(Pin) * 2U)));
#else
  register uint32_t *pReg = (uint32_t *)((uint32_t)(&GPIOx->CFGLOW) + (Pin >> 24));
  MODIFY_REG(*pReg, ((GPIO_CFGLOW_CFG0 | GPIO_CFGLOW_MODE0) << (POSITION_VAL(Pin) * 4U)), (Mode << (POSITION_VAL(Pin) * 4U)));
#endif /* GPIO_MODE_MODE0 */
}

/**
  * @brief  Return gpio mode for a dedicated pin on dedicated port.
  * @note   I/O mode can be Input mode, General purpose output, Alternate function mode or Analog.
  * @note   Warning: only one pin can be passed as parameter.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_GPIO_MODE_INPUT
  *         @arg @ref DDL_GPIO_MODE_OUTPUT
  *         @arg @ref DDL_GPIO_MODE_ALTERNATE
  *         @arg @ref DDL_GPIO_MODE_ANALOG
  *         @arg @ref DDL_GPIO_MODE_FLOATING (1)
  *
  *         (1) This parameter is only for APM32F402/403xx device.\n
  */
__STATIC_INLINE uint32_t DDL_GPIO_GetPinMode(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
#if defined (GPIO_MODE_MODE0)
  return (uint32_t)(READ_BIT(GPIOx->MODE,
                             (GPIO_MODE_MODE0 << (POSITION_VAL(Pin) * 2U))) >> (POSITION_VAL(Pin) * 2U));
#else
  register uint32_t *pReg = (uint32_t *)((uint32_t)(&GPIOx->CFGLOW) + (Pin >> 24));
  return (READ_BIT(*pReg, ((GPIO_CFGLOW_CFG0 | GPIO_CFGLOW_MODE0) << (POSITION_VAL(Pin) * 4U))) >> (POSITION_VAL(Pin) * 4U));
#endif /* GPIO_MODE_MODE0 */
}

/**
  * @brief  Configure gpio output type for several pins on dedicated port.
  * @note   Output type as to be set when gpio pin is in output or
  *         alternate modes. Possible type are Push-pull or Open-drain.
  * @param  GPIOx GPIO Port
  * @param  PinMask This parameter can be a combination of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  *         @arg @ref DDL_GPIO_PIN_ALL
  * @param  OutputType This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_OUTPUT_PUSHPULL
  *         @arg @ref DDL_GPIO_OUTPUT_OPENDRAIN
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_SetPinOutputType(GPIO_TypeDef *GPIOx, uint32_t PinMask, uint32_t OutputType)
{
#if defined (GPIO_OMODE_OMODE0)
  MODIFY_REG(GPIOx->OMODE, PinMask, (PinMask * OutputType));
#else
  register uint32_t *pReg = (uint32_t *)((uint32_t)(&GPIOx->CFGLOW) + (PinMask >> 24));
  MODIFY_REG(*pReg, (GPIO_CFGLOW_CFG0_0 << (POSITION_VAL(PinMask) * 4U)),
             (OutputType << (POSITION_VAL(PinMask) * 4U)));
#endif /* GPIO_OMODE_OMODE0 */
}

/**
  * @brief  Return gpio output type for several pins on dedicated port.
  * @note   Output type as to be set when gpio pin is in output or
  *         alternate modes. Possible type are Push-pull or Open-drain.
  * @note   Warning: only one pin can be passed as parameter.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  *         @arg @ref DDL_GPIO_PIN_ALL
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_GPIO_OUTPUT_PUSHPULL
  *         @arg @ref DDL_GPIO_OUTPUT_OPENDRAIN
  */
__STATIC_INLINE uint32_t DDL_GPIO_GetPinOutputType(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
#if defined (GPIO_OMODE_OMODE0)
  return (uint32_t)(READ_BIT(GPIOx->OMODE, Pin) >> POSITION_VAL(Pin));
#else
  register uint32_t *pReg = (uint32_t *)((uint32_t)(&GPIOx->CFGLOW) + (Pin >> 24));
  return (READ_BIT(*pReg, (GPIO_CFGLOW_CFG0_0 << (POSITION_VAL(Pin) * 4U))) >> (POSITION_VAL(Pin) * 4U));
#endif /* GPIO_OMODE_OMODE0 */
}

/**
  * @brief  Configure gpio speed for a dedicated pin on dedicated port.
  * @note   I/O speed can be Low, Medium, Fast or High speed.
  * @note   Warning: only one pin can be passed as parameter.
  * @note   Refer to datasheet for frequency specifications and the power
  *         supply and load conditions for each speed.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  * @param  Speed This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_SPEED_FREQ_LOW
  *         @arg @ref DDL_GPIO_SPEED_FREQ_MEDIUM
  *         @arg @ref DDL_GPIO_SPEED_FREQ_HIGH
  *         @arg @ref DDL_GPIO_SPEED_FREQ_VERY_HIGH (1)
  *
  *         (1) This parameter is only for APM32F402/403xx device.\n
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_SetPinSpeed(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t  Speed)
{
#if defined (GPIO_OSPEEDER_OSPEEDR0)
  MODIFY_REG(GPIOx->OSSEL, (GPIO_OSPEEDER_OSPEEDR0 << (POSITION_VAL(Pin) * 2U)),
             (Speed << (POSITION_VAL(Pin) * 2U)));
#else
  register uint32_t *pReg = (uint32_t *)((uint32_t)(&GPIOx->CFGLOW) + (Pin >> 24));
  MODIFY_REG(*pReg, (GPIO_CFGLOW_MODE0 << (POSITION_VAL(Pin) * 4U)),
             (Speed << (POSITION_VAL(Pin) * 4U)));
#endif /* GPIO_OSPEEDER_OSPEEDR0 */
}

/**
  * @brief  Return gpio speed for a dedicated pin on dedicated port.
  * @note   I/O speed can be Low, Medium, Fast or High speed.
  * @note   Warning: only one pin can be passed as parameter.
  * @note   Refer to datasheet for frequency specifications and the power
  *         supply and load conditions for each speed.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_GPIO_SPEED_FREQ_LOW
  *         @arg @ref DDL_GPIO_SPEED_FREQ_MEDIUM
  *         @arg @ref DDL_GPIO_SPEED_FREQ_HIGH
  *         @arg @ref DDL_GPIO_SPEED_FREQ_VERY_HIGH (1)
  *
  *         (1) This parameter is only for APM32F402/403xx device.\n
  */
__STATIC_INLINE uint32_t DDL_GPIO_GetPinSpeed(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
#if defined (GPIO_OSPEEDER_OSPEEDR0)
  return (uint32_t)(READ_BIT(GPIOx->OSSEL,
                             (GPIO_OSPEEDER_OSPEEDR0 << (POSITION_VAL(Pin) * 2U))) >> (POSITION_VAL(Pin) * 2U));
#else
  register uint32_t *pReg = (uint32_t *)((uint32_t)(&GPIOx->CFGLOW) + (Pin >> 24));
  return (READ_BIT(*pReg, (GPIO_CFGLOW_MODE0 << (POSITION_VAL(Pin) * 4U))) >> (POSITION_VAL(Pin) * 4U));
#endif /* GPIO_OSPEEDER_OSPEEDR0 */
}

/**
  * @brief  Configure gpio pull-up or pull-down for a dedicated pin on a dedicated port.
  * @note   Warning: only one pin can be passed as parameter.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  * @param  Pull This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PULL_NO   (1)
  *         @arg @ref DDL_GPIO_PULL_UP
  *         @arg @ref DDL_GPIO_PULL_DOWN
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_SetPinPull(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t Pull)
{
#if defined (GPIO_PUPD_PUPDR0)
  MODIFY_REG(GPIOx->PUPD, (GPIO_PUPD_PUPDR0 << (POSITION_VAL(Pin) * 2U)), (Pull << (POSITION_VAL(Pin) * 2U)));
#else
  MODIFY_REG(GPIOx->ODATA, (Pin >> GPIO_PIN_MASK_POS), Pull << (POSITION_VAL(Pin >> GPIO_PIN_MASK_POS)));
#endif /* GPIO_PUPD_PUPDR0 */
}

/**
  * @brief  Return gpio pull-up or pull-down for a dedicated pin on a dedicated port
  * @note   Warning: only one pin can be passed as parameter.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  *         @arg @ref DDL_GPIO_PIN_8
  *         @arg @ref DDL_GPIO_PIN_9
  *         @arg @ref DDL_GPIO_PIN_10
  *         @arg @ref DDL_GPIO_PIN_11
  *         @arg @ref DDL_GPIO_PIN_12
  *         @arg @ref DDL_GPIO_PIN_13
  *         @arg @ref DDL_GPIO_PIN_14
  *         @arg @ref DDL_GPIO_PIN_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_GPIO_PULL_NO   (1)
  *         @arg @ref DDL_GPIO_PULL_UP
  *         @arg @ref DDL_GPIO_PULL_DOWN
  */
__STATIC_INLINE uint32_t DDL_GPIO_GetPinPull(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
#if defined (GPIO_PUPD_PUPDR0)
  return (uint32_t)(READ_BIT(GPIOx->PUPD,
                             (GPIO_PUPD_PUPDR0 << (POSITION_VAL(Pin) * 2U))) >> (POSITION_VAL(Pin) * 2U));
#else
  return (READ_BIT(GPIOx->ODATA, (GPIO_ODATA_ODATA0 << (POSITION_VAL(Pin >> GPIO_PIN_MASK_POS))))
                   >> (POSITION_VAL(Pin >> GPIO_PIN_MASK_POS)));
#endif /* GPIO_PUPD_PUPDR0 */
}

#if defined (GPIO_ALFL_ALFSEL0)
/**
  * @brief  Configure gpio alternate function of a dedicated pin from 0 to 7 for a dedicated port.
  * @note   Possible values are from AF0 to AF15 depending on target.
  * @note   Warning: only one pin can be passed as parameter.
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_PIN_0
  *         @arg @ref DDL_GPIO_PIN_1
  *         @arg @ref DDL_GPIO_PIN_2
  *         @arg @ref DDL_GPIO_PIN_3
  *         @arg @ref DDL_GPIO_PIN_4
  *         @arg @ref DDL_GPIO_PIN_5
  *         @arg @ref DDL_GPIO_PIN_6
  *         @arg @ref DDL_GPIO_PIN_7
  * @param  Alternate This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_AF_0
  *         @arg @ref DDL_GPIO_AF_1
  *         @arg @ref DDL_GPIO_AF_2
  *         @arg @ref DDL_GPIO_AF_3
  *         @arg @ref DDL_GPIO_AF_4
  *         @arg @ref DDL_GPIO_AF_5
  *         @arg @ref DDL_GPIO_AF_6
  *         @arg @ref DDL_GPIO_AF_7
  *         @arg @ref DDL_GPIO_AF_8
  *         @arg @ref DDL_GPIO_AF_9
  *         @arg @ref DDL_GPIO_AF_10
  *         @arg @ref DDL_GPIO_AF_11
  *         @arg @ref DDL_GPIO_AF_12
  *         @arg @ref DDL_GPIO_AF_13
  *         @arg @ref DDL_GPIO_AF_14
  *         @arg @ref DDL_GPIO_AF_15
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_SetAFPin_0_7(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t Alternate)
{
  MODIFY_REG(GPIOx->ALF[0], (GPIO_ALFL_ALFSEL0 << (POSITION_VAL(Pin) * 4U)),
             (Alternate << (POSITION_VAL(Pin) * 4U)));
}

