betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_gpio.h
#if defined (AFIO)

/** @defgroup GPIO_AF_REMAPPING Alternate Function Remapping
  * @brief This section propose definition to remap the alternate function to some other port/pins.
  * @{
  */

/**
  * @brief  Enable the remapping of SPI1 alternate function NSS, SCK, MISO and MOSI.
  * @note   ENABLE: Remap (NSS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_SPI1(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_SPI1_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of SPI1 alternate function NSS, SCK, MISO and MOSI.
  * @note  DISABLE: No remap (NSS/PA4,  SCK/PA5, MISO/PA6, MOSI/PA7)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_SPI1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_SPI1_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if SPI1 has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_SPI1(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_SPI1_RMP) == (AFIO_REMAP1_SPI1_RMP));
}

/**
  * @brief Enable the remapping of I2C1 alternate function SCL and SDA.
  * @note  ENABLE: Remap     (SCL/PB8, SDA/PB9)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_I2C1(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_I2C1_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of I2C1 alternate function SCL and SDA.
  * @note  DISABLE: No remap (SCL/PB6, SDA/PB7)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_I2C1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_I2C1_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if I2C1 has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_I2C1(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_I2C1_RMP) == (AFIO_REMAP1_I2C1_RMP));
}

/**
  * @brief Enable the remapping of USART1 alternate function TX and RX.
  * @note  ENABLE: Remap     (TX/PB6, RX/PB7)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_USART1(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_USART1_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of USART1 alternate function TX and RX.
  * @rmtoll MAPR          USART1_REMAP           LL_GPIO_AF_DisableRemap_USART1
  * @note  DISABLE: No remap (TX/PA9, RX/PA10)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_USART1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_USART1_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if USART1 has been remaped or not
  * @rmtoll MAPR         USART1_REMAP         LL_GPIO_AF_IsEnabledRemap_USART1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_USART1(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_USART1_RMP) == (AFIO_REMAP1_USART1_RMP));
}

/**
  * @brief Enable the remapping of USART2 alternate function CTS, RTS, CK, TX and RX.
  * @note  ENABLE: Remap no effect
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_USART2(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_USART2_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of USART2 alternate function CTS, RTS, CK, TX and RX.
  * @note  DISABLE: No remap (CTS/PA0, RTS/PA1, TX/PA2, RX/PA3, CK/PA4)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_USART2(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_USART2_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if USART2 has been remaped or not
  * @rmtoll MAPR         USART2_REMAP         LL_GPIO_AF_IsEnabledRemap_USART2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_USART2(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_USART2_RMP) == (AFIO_REMAP1_USART2_RMP));
}

/**
  * @brief Enable the remapping of USART3 alternate function CTS, RTS, CK, TX and RX.
  * @note  PARTIAL: Partial remap (TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial_USART3(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_USART3_RMP | AFIO_REMAP1_SWJ_CFG),
                          (AFIO_REMAP1_USART3_RMP_PARTIALREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Disable the remapping of USART3 alternate function CTS, RTS, CK, TX and RX.
  * @note  DISABLE: No remap      (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_USART3(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_USART3_RMP | AFIO_REMAP1_SWJ_CFG),
                         (AFIO_REMAP1_USART3_RMP_NOREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of TMR1 alternate function channels 1 to 4, 1N to 3N, external trigger (ETR) and Break input (BKIN)
  * @note  PARTIAL: Partial remap (ETR/PA12, CH1/PA8, CH2/PA9,  CH3/PA10, CH4/PA11, BKIN/PA6,  CH1N/PA7,  CH2N/PB0,  CH3N/PB1)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial_TMR1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR1_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR1_RMP_PARTIALREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Disable the remapping of TMR1 alternate function channels 1 to 4, 1N to 3N, external trigger (ETR) and Break input (BKIN)
  * @note  DISABLE: No remap      (ETR/PA12, CH1/PA8, CH2/PA9,  CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_TMR1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR1_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR1_RMP_NOREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of TMR2 alternate function channels 1 to 4 and external trigger (ETR)
  * @note  ENABLE: Full remap       (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_TMR2(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR2_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR2_RMP_FULLREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of TMR2 alternate function channels 1 to 4 and external trigger (ETR)
  * @note  PARTIAL_2: Partial remap (CH1/ETR/PA0,  CH2/PA1, CH3/PB10, CH4/PB11)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial2_TMR2(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR2_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR2_RMP_PARTIALREMAP2 | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of TMR2 alternate function channels 1 to 4 and external trigger (ETR)
  * @note  PARTIAL_1: Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2,  CH4/PA3)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial1_TMR2(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR2_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR2_RMP_PARTIALREMAP1 | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Disable the remapping of TMR2 alternate function channels 1 to 4 and external trigger (ETR)
  * @note  DISABLE: No remap        (CH1/ETR/PA0,  CH2/PA1, CH3/PA2,  CH4/PA3)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_TMR2(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR2_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR2_RMP_NOREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of TMR3 alternate function channels 1 to 4
  * @note  ENABLE: Full remap     (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)
  * @note  TMR3_ETR on PE0 is not re-mapped.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_TMR3(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR3_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR3_RMP_FULLREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of TMR3 alternate function channels 1 to 4
  * @note  PARTIAL: Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)
  * @note  TMR3_ETR on PE0 is not re-mapped.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial_TMR3(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR3_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR3_RMP_PARTIALREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Disable the remapping of TMR3 alternate function channels 1 to 4
  * @note  DISABLE: No remap      (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)
  * @note  TMR3_ETR on PE0 is not re-mapped.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_TMR3(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR3_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_TMR3_RMP_NOREMAP | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of TMR4 alternate function channels 1 to 4.
  * @note  ENABLE: Full remap  no effect
  * @note  TMR4_ETR on PE0 is not re-mapped.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_TMR4(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_TMR4_RMP | AFIO_REMAP1_SWJ_CFG);
}
/**
  * @brief Disable the remapping of TMR4 alternate function channels 1 to 4.
  * @note  DISABLE: No remap  (TMR4_CH1/PB6,  TMR4_CH2/PB7,  TMR4_CH3/PB8,  TMR4_CH4/PB9)
  * @note  TMR4_ETR on PE0 is not re-mapped.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_TMR4(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR4_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if TMR4 has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_TMR4(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_TMR4_RMP) == (AFIO_REMAP1_TMR4_RMP));
}

/**
  * @brief Enable or disable the remapping of CAN alternate function CAN_RX and CAN_TX in devices with a single CAN interface.
  * @note  CASE 1: CAN_RX mapped to PA11, CAN_TX mapped to PA12
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial1_CAN1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_CAN1_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_CAN1_RMP_REMAP1 | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable or disable the remapping of CAN alternate function CAN_RX and CAN_TX in devices with a single CAN interface.
  * @note  CASE 2: CAN_RX mapped to PB8,  CAN_TX mapped to PB9 (not available on 36-pin package)
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial2_CAN1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_CAN1_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_CAN1_RMP_REMAP2 | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable or disable the remapping of CAN alternate function CAN_RX and CAN_TX in devices with a single CAN interface.
  * @note  CASE 3: CAN_RX mapped to PD0,  CAN_TX mapped to PD1
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_RemapPartial3_CAN1(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_CAN1_RMP | AFIO_REMAP1_SWJ_CFG), (AFIO_REMAP1_CAN1_RMP_REMAP3 | AFIO_REMAP1_SWJ_CFG));
}

/**
  * @brief Enable the remapping of PD0 and PD1. When the HSE oscillator is not used
  *        (application running on internal 8 MHz RC) PD0 and PD1 can be mapped on OSC_IN and
  *        OSC_OUT. This is available only on 36, 48 and 64 pins packages (PD0 and PD1 are available
  *        on 100-pin and 144-pin packages, no need for remapping).
  * @note  ENABLE: PD0 remapped on OSC_IN, PD1 remapped on OSC_OUT.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_PD01(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_PD01_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of PD0 and PD1. When the HSE oscillator is not used
  *        (application running on internal 8 MHz RC) PD0 and PD1 can be mapped on OSC_IN and
  *        OSC_OUT. This is available only on 36, 48 and 64 pins packages (PD0 and PD1 are available
  *        on 100-pin and 144-pin packages, no need for remapping).
  * @note  DISABLE: No remapping of PD0 and PD1
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_PD01(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_PD01_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if PD01 has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_PD01(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_PD01_RMP) == (AFIO_REMAP1_PD01_RMP));
}

/**
  * @brief Enable the remapping of TMR5CH4.
  * @note  ENABLE: LSI internal clock is connected to TMR5_CH4 input for calibration purpose.
  * @note  This function is available only in high density value line devices.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_TMR5CH4(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_TMR5CH4_IRMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of TMR5CH4.
  * @note  DISABLE: TMR5_CH4 is connected to PA3
  * @note  This function is available only in high density value line devices.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_TMR5CH4(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_TMR5CH4_IRMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if TMR5CH4 has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_TMR5CH4(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_TMR5CH4_IRMP) == (AFIO_REMAP1_TMR5CH4_IRMP));
}

/**
  * @brief Enable the remapping of ADC1_ETRGINJ (ADC 1 External trigger injected conversion).
  * @note  ENABLE: ADC1 External Event injected conversion is connected to TMR8 Channel4.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_ADC1_ETRGINJ(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC1_ETRGINJC_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of ADC1_ETRGINJ (ADC 1 External trigger injected conversion).
  * @note  DISABLE: ADC1 External trigger injected conversion is connected to EINT15
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_ADC1_ETRGINJ(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_ADC1_ETRGINJC_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if ADC1_ETRGINJ has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_ADC1_ETRGINJ(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC1_ETRGINJC_RMP) == (AFIO_REMAP1_ADC1_ETRGINJC_RMP));
}

/**
  * @brief Enable the remapping of ADC1_ETRGREG (ADC 1 External trigger regular conversion).
  * @note  ENABLE: ADC1 External Event regular conversion is connected to TMR8 TRG0.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_ADC1_ETRGREG(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC1_ETRGREGC_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of ADC1_ETRGREG (ADC 1 External trigger regular conversion).
  * @note  DISABLE: ADC1 External trigger regular conversion is connected to EINT11
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_ADC1_ETRGREG(void)
{
   MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_ADC1_ETRGREGC_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if ADC1_ETRGREG has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_ADC1_ETRGREG(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC1_ETRGREGC_RMP) == (AFIO_REMAP1_ADC1_ETRGREGC_RMP));
}

/**
  * @brief Enable the remapping of ADC2_ETRGREG (ADC 2 External trigger injected conversion).
  * @note  ENABLE: ADC2 External Event injected conversion is connected to TMR8 Channel4.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_ADC2_ETRGINJ(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC2_ETRGINJC_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of ADC2_ETRGREG (ADC 2 External trigger injected conversion).
  * @note  DISABLE: ADC2 External trigger injected conversion is connected to EINT15
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_ADC2_ETRGINJ(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_ADC2_ETRGINJC_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if ADC2_ETRGINJ has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_ADC2_ETRGINJ(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC2_ETRGINJC_RMP) == (AFIO_REMAP1_ADC2_ETRGINJC_RMP));
}

/**
  * @brief Enable the remapping of ADC2_ETRGREG (ADC 2 External trigger regular conversion).
  * @note  ENABLE: ADC2 External Event regular conversion is connected to TMR8 TRG0.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_ADC2_ETRGREG(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC2_ETRGREGC_RMP | AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief Disable the remapping of ADC2_ETRGREG (ADC 2 External trigger regular conversion).
  * @note  DISABLE: ADC2 External trigger regular conversion is connected to EINT11
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_ADC2_ETRGREG(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_ADC2_ETRGREGC_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if ADC2_ETRGREG has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_ADC2_ETRGREG(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_ADC2_ETRGREGC_RMP) == (AFIO_REMAP1_ADC2_ETRGREGC_RMP));
}

/**
  * @brief Enable the remapping of CAN2 alternate function CAN2_RX and CAN2_TX.
  * @note  ENABLE: Remap     (CAN2_RX/PB5,  CAN2_TX/PB6)
  * @note  This bit is available only in connectivity line devices and is reserved otherwise.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_CAN2(void)
{
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_CAN2_RMP | AFIO_REMAP1_SWJ_CFG);
}
/**
  * @brief Disable the remapping of CAN2 alternate function CAN2_RX and CAN2_TX.
  * @note  DISABLE: No remap (CAN2_RX/PB12, CAN2_TX/PB13)
  * @note  This bit is available only in connectivity line devices and is reserved otherwise.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_CAN2(void)
{
  MODIFY_REG(AFIO->REMAP1, (AFIO_REMAP1_CAN2_RMP | AFIO_REMAP1_SWJ_CFG), AFIO_REMAP1_SWJ_CFG);
}

/**
  * @brief  Check if CAN2 has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_IsEnabledRemap_CAN2(void)
{
  return (READ_BIT(AFIO->REMAP1, AFIO_REMAP1_CAN2_RMP) == (AFIO_REMAP1_CAN2_RMP));
}

/**
  * @brief Enable the Serial wire JTAG configuration
  * @note  ENABLE: Full SWJ (JTAG-DP + SW-DP): Reset State
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableRemap_SWJ(void)
{
  CLEAR_BIT(AFIO->REMAP1,AFIO_REMAP1_SWJ_CFG);
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_SWJ_CFG_RESET);
}

/**
  * @brief Enable the Serial wire JTAG configuration
  * @note  NONJTRST: Full SWJ (JTAG-DP + SW-DP) but without NJTRST
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_Remap_SWJ_NONJTRST(void)
{
  CLEAR_BIT(AFIO->REMAP1,AFIO_REMAP1_SWJ_CFG);
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_SWJ_CFG_NOJNTRST);
}

/**
  * @brief Enable the Serial wire JTAG configuration
  * @note  NOJTAG: JTAG-DP Disabled and SW-DP Enabled
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_Remap_SWJ_NOJTAG(void)
{
  CLEAR_BIT(AFIO->REMAP1,AFIO_REMAP1_SWJ_CFG);
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_SWJ_CFG_JTAGDISABLE);
}

/**
  * @brief Disable the Serial wire JTAG configuration
  * @note  DISABLE: JTAG-DP Disabled and SW-DP Disabled
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableRemap_SWJ(void)
{
  CLEAR_BIT(AFIO->REMAP1,AFIO_REMAP1_SWJ_CFG);
  SET_BIT(AFIO->REMAP1, AFIO_REMAP1_SWJ_CFG_DISABLE);
}

/**
  * @}
  */

