betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_gpio.h
/** @defgroup GPIO_AF_LL_EVENTOUT Output Event configuration
  * @brief This section propose definition to Configure EVENTOUT Cortex feature .
  * @{
  */

/**
  * @brief  Configures the port and pin on which the EVENTOUT Cortex signal will be connected.
  * @param  DDL_GPIO_PortSource This parameter can be one of the following values:
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PORT_A
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PORT_B
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PORT_C
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PORT_D
  * @param  DDL_GPIO_PinSource This parameter can be one of the following values:
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_0
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_1
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_2
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_3
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_4
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_5
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_6
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_7
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_8
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_9
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_10
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_11
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_12
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_13
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_14
  *      @arg @ref DDL_GPIO_AF_EVENTOUT_PIN_15
  * @retval None
*/
__STATIC_INLINE void DDL_GPIO_AF_ConfigEventout(uint32_t DDL_GPIO_PortSource, uint32_t DDL_GPIO_PinSource)
{
  MODIFY_REG(AFIO->EVCTRL, (AFIO_EVCTRL_PORTSEL_Msk) | (AFIO_EVCTRL_PINSEL), (DDL_GPIO_PortSource) | (DDL_GPIO_PinSource));
}

/**
  * @brief  Enables the Event Output.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_EnableEventout(void)
{
  SET_BIT(AFIO->EVCTRL, AFIO_EVCTRL_EVOEN);
}

/**
  * @brief  Disables the Event Output.
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_DisableEventout(void)
{
  CLEAR_BIT(AFIO->EVCTRL, AFIO_EVCTRL_EVOEN);
}

/**
  * @}
  */

/** @defgroup GPIO_AF_DDL_EINT EINT external interrupt
  * @brief This section Configure source input for the EINT external interrupt .
  * @{
  */

/**
  * @brief  Configure source input for the EINT external interrupt.
  * @param  Port This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_AF_EINT_PORTA
  *         @arg @ref DDL_GPIO_AF_EINT_PORTB
  *         @arg @ref DDL_GPIO_AF_EINT_PORTC
  *         @arg @ref DDL_GPIO_AF_EINT_PORTD
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_AF_EINT_LINE0
  *         @arg @ref DDL_GPIO_AF_EINT_LINE1
  *         @arg @ref DDL_GPIO_AF_EINT_LINE2
  *         @arg @ref DDL_GPIO_AF_EINT_LINE3
  *         @arg @ref DDL_GPIO_AF_EINT_LINE4
  *         @arg @ref DDL_GPIO_AF_EINT_LINE5
  *         @arg @ref DDL_GPIO_AF_EINT_LINE6
  *         @arg @ref DDL_GPIO_AF_EINT_LINE7
  *         @arg @ref DDL_GPIO_AF_EINT_LINE8
  *         @arg @ref DDL_GPIO_AF_EINT_LINE9
  *         @arg @ref DDL_GPIO_AF_EINT_LINE10
  *         @arg @ref DDL_GPIO_AF_EINT_LINE11
  *         @arg @ref DDL_GPIO_AF_EINT_LINE12
  *         @arg @ref DDL_GPIO_AF_EINT_LINE13
  *         @arg @ref DDL_GPIO_AF_EINT_LINE14
  *         @arg @ref DDL_GPIO_AF_EINT_LINE15
  * @retval None
  */
__STATIC_INLINE void DDL_GPIO_AF_SetEINTSource(uint32_t Port, uint32_t Line)
{
  MODIFY_REG(AFIO->EINTSEL[Line & 0xFF], (Line >> 16), Port << POSITION_VAL((Line >> 16)));
}

/**
  * @brief  Get the configured defined for specific EINT Line
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref DDL_GPIO_AF_EINT_LINE0
  *         @arg @ref DDL_GPIO_AF_EINT_LINE1
  *         @arg @ref DDL_GPIO_AF_EINT_LINE2
  *         @arg @ref DDL_GPIO_AF_EINT_LINE3
  *         @arg @ref DDL_GPIO_AF_EINT_LINE4
  *         @arg @ref DDL_GPIO_AF_EINT_LINE5
  *         @arg @ref DDL_GPIO_AF_EINT_LINE6
  *         @arg @ref DDL_GPIO_AF_EINT_LINE7
  *         @arg @ref DDL_GPIO_AF_EINT_LINE8
  *         @arg @ref DDL_GPIO_AF_EINT_LINE9
  *         @arg @ref DDL_GPIO_AF_EINT_LINE10
  *         @arg @ref DDL_GPIO_AF_EINT_LINE11
  *         @arg @ref DDL_GPIO_AF_EINT_LINE12
  *         @arg @ref DDL_GPIO_AF_EINT_LINE13
  *         @arg @ref DDL_GPIO_AF_EINT_LINE14
  *         @arg @ref DDL_GPIO_AF_EINT_LINE15
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_GPIO_AF_EINT_PORTA
  *         @arg @ref DDL_GPIO_AF_EINT_PORTB
  *         @arg @ref DDL_GPIO_AF_EINT_PORTC
  *         @arg @ref DDL_GPIO_AF_EINT_PORTD
  */
__STATIC_INLINE uint32_t DDL_GPIO_AF_GetEINTSource(uint32_t Line)
{
  return (uint32_t)(READ_BIT(AFIO->EINTSEL[Line & 0xFF], (Line >> 16)) >> POSITION_VAL(Line >> 16));
}

/**
  * @}
  */
#endif /* AFIO */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup GPIO_DDL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus DDL_GPIO_DeInit(GPIO_TypeDef *GPIOx);
ErrorStatus DDL_GPIO_Init(GPIO_TypeDef *GPIOx, DDL_GPIO_InitTypeDef *GPIO_InitStruct);
void        DDL_GPIO_StructInit(DDL_GPIO_InitTypeDef *GPIO_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (GPIOA) || defined (GPIOB) || defined (GPIOC) || defined (GPIOD) || defined (GPIOE) || defined (GPIOF) || defined (GPIOG) || defined (GPIOH) || defined (GPIOI) || defined (GPIOJ) || defined (GPIOK) */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_GPIO_H */

